# Вариант 7.
# Дан сет А и сет В. Сеты А и В включают в себя по 6 элементов типа строка. Некоторые из
# элементов сета А повторяются в сете В. Провести следующие операции над сетами:
# a. определить размер каждого сета; узнать имеют ли сеты общие элементы (True – не имеют);
# b. проверить все ли элементы сета А принадлежат сету В;
# c. Произвести объединение, пересечение, вычитание сетов.

A = set(["a", "b", "c", "d", "f", "e"])
A1 = set(["a", "b", "c", "d", "f", "e", "5"])
B = set(["a", "g", "c", "d", "r", "e"])
N = ("1", "2", "3", "4", "5", "6")

# a
print("Длина сета A = ", len(A), "; Длина сета В = ", len(B))
print("Имеют ли сеты общие эл-ты (True - не имеют): ", A in B)

# b
print("Все ли элементы сета А принадлежат сету В: ", A <= B)

# c
inter = A & B
union = A | B
diff = A - B
print("Пересечение: ", inter, "\nОбъединение: ", union, "\nВычитание: ", diff)